industry_types_names = [
    ["Республика Казахстан","Всего"],
    ["Сельское, лесное и рыбное хозяйство","Сельское, лесное и рыбное хозяйство"],
    ["Промышленность", "Промышленность"],
    ["Горнодобывающая промышленность","Горнодобывающая промышленность и разработка карьеров"],
    ["Обрабатывающая промышленность","Обрабатывающая промышленность",],
    ["Снабжение электроэнергией","Снабжение электроэнергией, газом, паром, горячей водой и кондиционированным воздухом"],
    ["Водоснабжение","Водоснабжение; сбор, обработка и удаление отходов, деятельность по ликвидации загрязнений"],
    ["Строительство","Строительство"],
    ["Оптовая и розничная торговля","Оптовая и розничная торговля; ремонт автомобилей и мотоциклов"],
    ["Транспорт и складирование","Транспорт и складирование"],
    ["Предоставление услуг по проживанию и питанию","Предоставление услуг по проживанию и питанию"],
    ["Информация и связь","Информация и связь"],
    ["Финансовая и страховая деятельность","Финансовая и страховая деятельность"],
    ["Операции с недвижимым имуществом","Операции с недвижимым имуществом"],
    ["Профессиональная, научная и техническая деятельность","Профессиональная, научная и техническая деятельность"],
    ["Деятельность в области административного обслуживания","Деятельность в области административного и вспомогательного обслуживания"],
    ["Государственное управление и оборона","Государственное управление и оборона; обязательное  социальное обеспечение"],
    ["Образование","Образование"],
    ["Здравоохранение","Здравоохранение и социальное обслуживание населения"],
    ["Искусство, развлечения и отдых","Искусство, развлечения и отдых"],
    ["Предоставление прочих видов услуг","Предоставление прочих видов услуг"]
]

region_names = [
    ["Республика Казахстан","РЕСПУБЛИКА КАЗАХСТАН"],
    ["Абайская","ОБЛАСТЬ АБАЙ"],
    ["Акмолинская","АКМОЛИНСКАЯ ОБЛАСТЬ"],
    ["Актюбинская","АКТЮБИНСКАЯ ОБЛАСТЬ"],
    ["Алматинская","АЛМАТИНСКАЯ ОБЛАСТЬ"],
    ["Атырауская","АТЫРАУСКАЯ ОБЛАСТЬ"],
    ["Западно-Казахстанская","ЗАПАДНО-КАЗАХСТАНСКАЯ ОБЛАСТЬ"],
    ["Жамбылская","ЖАМБЫЛСКАЯ ОБЛАСТЬ"],
    ["Жетысу","ОБЛАСТЬ ЖЕТІСУ"],
    ["Карагандинская","КАРАГАНДИНСКАЯ ОБЛАСТЬ"],
    ["Костанайская","КОСТАНАЙСКАЯ ОБЛАСТЬ"],
    ["Кызылординская","КЫЗЫЛОРДИНСКАЯ ОБЛАСТЬ"],
    ["Мангистауская","МАНГИСТАУСКАЯ ОБЛАСТЬ"],
    ["Павлодарская","ПАВЛОДАРСКАЯ ОБЛАСТЬ"],
    ["Северо-Казахстанская","СЕВЕРО-КАЗАХСТАНСКАЯ ОБЛАСТЬ"],
    ["Туркестанская","ТУРКЕСТАНСКАЯ ОБЛАСТЬ"],
    ["Улытауская","ОБЛАСТЬ ҰЛЫТАУ"],
    ["Восточно-Казахстанская","ВОСТОЧНО-КАЗАХСТАНСКАЯ ОБЛАСТЬ"],
    ["г. Астана","Г.АСТАНА"],
    ["г. Алматы","Г.АЛМАТЫ"],
    ["г. Шымкент","Г.ШЫМКЕНТ"]
]


months = [
    ["янв", 'Январь'], 
    ["фев", 'Февраль'], 
    ["мар", 'Март'], 
    ["апр", 'Апрель'], 
    ["май", 'Май'], 
    ["июн", 'Июнь'], 
    ["июл", 'Июль'], 
    ["авг", 'Август'], 
    ["сен", 'Сентябрь'], 
    ["окт", 'Октябрь'], 
    ["ноя", 'Ноябрь'], 
    ["дек", 'Декабрь']
]

quarters = [
    ["мар", 'Март'], 
    ["июн", 'Июнь'], 
    ["сен", 'Сентябрь'], 
    ["дек", 'Декабрь']
]

cons_index_names = [
    ["Потребительские цены", 'Товары и услуги'], 
    ["Продовольственные товары", 'Продовольственные товары'], 
    ["Непродовольственные товары", 'Непродовольственные товары'], 
    ["Платные услуги", 'Платные услуги'], 
    ["Цены производителей", 'Промышленность']
]


labor_stats_names = [
    ["Рабочая сила","Рабочая сила"],
    ["Занятость (тыс. человек)","Занятость"],
    ["Сельское, лесное и рыбное хозяйство","Сельское, лесное и рыбное хозяйство"],
    #"Промышленность" Конкретно в этом показателе, это сумма всех 4 до строительства внизу
    ["Горнодобывающая промышленность","Горнодобывающая промышленность и разработка карьеров"],
    ["Обрабатывающая промышленность","Обрабатывающая промышленность"],
    ["Снабжение электроэнергией","Снабжение электроэнергией, газом, паром, горячей водой и кондиционированным воздухом"],
    ["Водоснабжение","Водоснабжение; сбор, обработка и удаление отходов, деятельность по ликвидации загрязнений"],
    ["Строительство","Строительство"],
    ["Оптовая и розничная торговля","Оптовая и розничная торговля; ремонт автомобилей и мотоциклов"],
    ["Транспорт и складирование","Транспорт и складирование"],
    ["Предоставление услуг по проживанию и питанию","Предоставление услуг по проживанию и питанию"],
    ["Информация и связь","Информация и связь"],
    ["Финансовая и страховая деятельность","Финансовая и страховая деятельность"],
    ["Операции с недвижимым имуществом","Операции с недвижимым имуществом"],
    ["Профессиональная, научная и техническая деятельность","Профессиональная, научная и техническая деятельность"],
    ["Деятельность в области административного и вспомогательного обслуживания","Деятельность в области административного и вспомогательного обслуживания"],
    ["Государственное управление и оборона","Государственное управление и оборона; обязательное  социальное обеспечение"],
    ["Образование","Образование"],
    ["Здравоохранение и социальное обслуживание населения","Здравоохранение и социальное обслуживание населения"],
    ["Искусство, развлечения и отдых","Искусство, развлечения и отдых"],
    ["Предоставление прочих видов услуг","Предоставление прочих видов услуг"],
    ["Наемные работники, тыс. человек","Наемные работники"],
    ["Самозанятые, тыс. человек","Самозанятые"],
    ["Численность безработных, тыс. человек","Численность безработных"],
    ["Уровень безработицы, %","Уровень безработицы"],
    ["Доходы населения (на душу населения в год, тенге)", "Доходы"],
    ["Средняя заработная плата в тенге","Средняя заработная плата"]
]

msp_names = [
        ["АПК","Сельское, лесное и рыбное хозяйство"],
        ["Промышленность, в том числе:","ПРОМЫШЛЕННОСТЬ"],
        ["Обрабатывающая промышленность","Обрабатывающая промышленность"],
        ["Строительство","Строительство"],
        ["Услуги, в том числе:","УСЛУГИ"],
        ["Оптовая и розничная торговля; ремонт автомобилей и мотоциклов","Оптовая и розничная торговля; ремонт автомобилей и мотоциклов"],
        ["Транспорт и складирование","Транспорт и складирование"],
        ["Предоставление услуг по проживанию и питанию","Предоставление услуг по проживанию и питанию"],
        ["Информацию и связь","Информация и связь"],
        ["Финансовую и страховую деятельность","Финансовая и страховая деятельность"],
        ["Операции с недвижимым имуществом","Операции с недвижимым имуществом"],
        ["Профессиональную, научную и техническую деятельность","Профессиональная, научная и техническая деятельность"],
        ["Деятельность в области административного и вспомогательного обслуживания","Деятельность в области административного и вспомогательного обслуживания"],
        ["Образование","Образование"],
        ["Здравоохранение и социальное обслуживание населения","Здравоохранение и социальное обслуживание населения"],
        ["Искусство, развлечения и отдых","Искусство, развлечения и отдых"],
        ["Предоставление прочих видов услуг","Предоставление прочих видов услуг"]
]

msp_query_names = [
    'Сельское, лесное и рыбное хозяйство',
    'Обрабатывающая промышленность',
    'Строительство',
    'Оптовая и розничная торговля; ремонт автомобилей и мотоциклов',
    'Транспорт и складирование',
    'Предоставление услуг по проживанию и питанию',
    'Информация и связь',
    'Финансовая и страховая деятельность',
    'Операции с недвижимым имуществом',
    'Профессиональная, научная и техническая деятельность',
    'Деятельность в области административного и вспомогательного обслуживания',
    'Образование',
    'Здравоохранение и социальное обслуживание населения',
    'Искусство, развлечения и отдых',
    'Предоставление прочих видов услуг',
    'Всего',

    'Горнодобывающая промышленность и разработка карьеров',
    'Обрабатывающая промышленность',
    'Снабжение электроэнергией, газом, паром, горячей водой и кондиционированным воздухом',
    'Водоснабжение; сбор, обработка и удаление отходов, деятельность по ликвидации загрязнений',

    'Оптовая и розничная торговля; ремонт автомобилей и мотоциклов',
    'Транспорт и складирование',
    'Предоставление услуг по проживанию и питанию',
    'Информация и связь',
    'Финансовая и страховая деятельность',
    'Операции с недвижимым имуществом',
    'Профессиональная, научная и техническая деятельность',
    'Деятельность в области административного и вспомогательного обслуживания',
    'Государственное управление и оборона; обязательное  социальное обеспечение',
    'Образование',
    'Здравоохранение и социальное обслуживание населения',
    'Искусство, развлечения и отдых',
    'Предоставление прочих видов услуг',
]

labor_productivity_names = [
    ["Производительность труда тыс. тенге","Производительность труда"],
    ["Производитство товаров","Производитство товаров"],
    ["Сельское, лесное и рыбное хозяйство","Сельское, лесное и рыбное хозяйство"],
    ["Промышленность","Промышленность"],
    ["Горнодобывающая промышленность","Горнодобывающая промышленность и разработка карьеров"],
    ["Обрабатывающая промышленность","Обрабатывающая промышленность"],
    ["Электроэнергия","Снабжение электроэнергией, газом, паром, горячей водой и кондиционированным воздухом"],
    ["Водоснабжение","Водоснабжение; сбор, обработка и удаление отходов, деятельность по ликвидации загрязнений"],
    ["Строительство","Строительство"],
    ["Производство услуг","Производство услуг"],
    ["Оптовая и розничная торговля","Оптовая и розничная торговля; ремонт автомобилей и мотоциклов"],
    ["Транспорт и складирование","Транспорт и складирование"],
    ["Предоставление услуг по проживанию и питанию","Предоставление услуг по проживанию и питанию"],
    ["Информация и связь","Информация и связь"],
    ["Финансовая и страховая деятельность","Финансовая и страховая деятельность"],
    ["Операции с недвижимым имуществом","Операции с недвижимым имуществом"],
    ["Профессиональная, научная и техническая деятельность","Профессиональная, научная и техническая деятельность"],
    ["Деятельность в области административного и вспомогательного обслуживания","Деятельность в области административного и вспомогательного обслуживания"],
    ["Государственное управление и оборона","Государственное управление и оборона; обязательное  социальное обеспечение"],
    ["Образование","Образование"],
    ["Здравоохранение и социальное обслуживание населения","Здравоохранение и социальное обслуживание населения"],
    ["Искусство, развлечения и отдых","Искусство, развлечения и отдых"],
    ["Предоставление прочих видов услуг","Предоставление прочих видов услуг"]
]

capital_investment_names = [
    ["Инвестиции в основной капитал","Всего"],
    ["Сельское, лесное и рыбное хозяйство","Сельское, лесное и рыбное хозяйство"],
    ["Промышленность","Промышленность"],
	["Горнодобывающая промышленность","Горнодобывающая промышленность и разработка карьеров"],
	["Обрабатывающая промышленность","Обрабатывающая промышленность"],
	["Электроэнергия","Снабжение электроэнергией, газом, паром, горячей водой и кондиционированным воздухом"],
	["Водоснабжение","Водоснабжение; сбор, обработка и удаление отходов, деятельность по ликвидации загрязнений"],
	["Строительство","Строительство"],
	["Торговля","Оптовая и розничная торговля; ремонт автомобилей и мотоциклов"],
	["Транспорт и складирование","Транспорт и складирование"],
	["Услуги по проживанию и питанию","Предоставление услуг по проживанию и питанию"],
	["Информация и связь","Информация и связь"],
	["Финансовая и страховая деятельность","Финансовая и страховая деятельность"],
	["Операции с недвижимым имуществом","Операции с недвижимым имуществом"],
	["Профессиональная, научная и техническая деятельность","Профессиональная, научная и техническая деятельность"],
	["Деятельность в области административного и вспомогательного обслуживания","Деятельность в области административного и вспомогательного обслуживания"],
	["Государственное управление и оборона","Государственное управление и оборона; обязательное  социальное обеспечение"],
	["Образование","Образование"],
	["Здравоохранение и социальное обслуживание населения","Здравоохранение и социальное обслуживание населения"],
	["Искусство, развлечения и отдых","Искусство, развлечения и отдых"],
	["Предоставление прочих видов услуг","Предоставление прочих видов услуг"]
]

capital_investment_by_funding_names = [
    ["Бюджетные средства","Бюджетные средства"],
    ["Собственные средства","Собственные средства"],
    ["Кредиты банков","Кредиты банков"],
	["Другие заемные средства","Другие заемные средства"]
]

ppi_names = [
    ["ИФО ВВП, %","ИФО"],

    ["Промышленность","Промышленность"],
    ["горнодобывающая","Горнодобывающая промышленность и разработка карьеров"],
    ["добыча сырой нефти, млн тонн","Горнодобывающая промышленность и разработка карьеров"],
    ["обрабатывающая","Обрабатывающая промышленность"],

    ["Сельское, лесное и рыбное хозяйство","Сельское, лесное и рыбное хозяйство"],
    ["растениеводство","растениеводство"],
    ["Сбор зерновых культур, млн  тонн","зерна"],
    ["животноводство","животноводство"],

    ["Строительство","Строительство"],
    ["ввод жилья, в тыс. кв. м","жилье квадрат"],
    ["ввод жилья, в %","жилье процент"],

    ["Торговля","Оптовая и розничная торговля; ремонт автомобилей и мотоциклов"],
    ["розничная","розничная торговля"],
    ["оптовая","оптовая торговля"],

    ["Транспорт","Транспорт и складирование"],
    ["Информация и связь","Информация и связь"],
    ["Предоставление услуг по проживанию и питанию","Предоставление услуг по проживанию и питанию"],
    ["Финансовая и страховая деятельность","Финансовая и страховая деятельность"],
    ["Операции с недвижимым имуществом","Операции с недвижимым имуществом"],
    ["Профессиональная, научная и техническая деятельность","Профессиональная, научная и техническая деятельность"],
    ["Деятельность в области административного и вспомогательного обслуживания","Деятельность в области административного и вспомогательного обслуживания"],
    ["Государственное управление и оборона","Государственное управление и оборона; обязательное  социальное обеспечение"],
    ["Образование","Образование"],
    ["Здравоохранение и социальное обслуживание населения","Здравоохранение и социальное обслуживание населения"],
    ["Искусство, развлечения и отдых","Искусство, развлечения и отдых"],
    ["Предоставление прочих видов услуг","Предоставление прочих видов услуг"]
]


quarter_list = {"1 квартал" : 0, "2 квартал": 0, "3 квартал": 0, "4 квартал": 0}

month_accum_list = {"Январь - Январь": 0, "Январь - Февраль": 0, "Январь - Март": 0, "Январь - Апрель": 0, "Январь - Май": 0, "Январь - Июнь": 0, 
                    "Январь - Июль": 0, "Январь - Август": 0, "Январь - Сентябрь": 0, "Январь - Октябрь": 0, "Январь - Ноябрь": 0, "Январь - Декабрь": 0}